Repository: PaulNishanthR/flutter_projects
Catalog: lib/l10n/app_*.arb
Languages: hi, ta

source: projects
hi: परियोजनाएं
ta: திட்டங்கள்

source: Create New Project
hi: नई परियोजना बनाएं
ta: புதிய திட்டம் உருவாக்க

# projectName
source: Project
hi: परियोजना का नाम
ta: திட்டம்

source: Description
hi: विवरण
ta: விளக்கம்

# projectOwner
source: Project Leader
hi: परियोजना मालिक
ta: திட்ட தலைவர்

source: Work Hours
hi: काम का समय
ta: வேலை நேரம்

# teamMembers
source: Total Team Members
hi: टीम सदस्य
ta: குழு உறுப்பினர் எண்ணிக்கை

source: Number of tasks
hi: कार्यों की संख्या
ta: பணிகளின் எண்ணிக்கை

source: Task Name
hi: कार्य का नाम
ta: பணி பெயர்

source: Task Description
hi: कार्य का विवरण
ta: பணி விளக்கம்

# searchTeamMembers
source: Select Members
hi: टीम सदस्य खोजें
ta: உறுப்பினர்கள்

source: Submit
hi: प्रस्तुत
ta: சமர்ப்பிக்க

source: About
hi: के बारे में
ta: தகவல்

source: Settings
hi: सेटिंग्स
ta: அமைப்புகள்

source: Logout
hi: लॉग आउट
ta: வெளியேறு

# yourProjects
source: You're assigned to,
hi: आपकी परियोजनाएं
ta: உங்கள் திட்டம்,

# enterprojectname
source: Please enter project name.
hi: कृपया प्रोजेक्ट का नाम दर्ज करें.
ta: திட்டத்தின் பெயரை உள்ளிடவும்.

# enterprojectdesc
source: Please enter project description.
hi: कृपया परियोजना का विवरण दर्ज करें.
ta: திட்ட விளக்கத்தை உள்ளிடவும்.

# enterprojecthours
source: Please enter working hours.
hi: कृपया कार्य के घंटे दर्ज करें.
ta: வேலை நேரத்தை உள்ளிடவும்.

# enterowner
source: Please select project leader.
hi: कृपया परियोजना प्रबंधक का नाम दर्ज करें.
ta: திட்ட தலைவரைத் தேர்ந்தெடுக்கவும்.

# entermembers
source: Please enter no. of team members.
hi: कृपया टीम के सदस्यों की संख्या दर्ज करें.
ta: குழு உறுப்பினர்களை உள்ளிடவும்.

# entertaskname
source: Please enter task name.
hi: कृपया कार्य का नाम दर्ज करें.
ta: பணியின் பெயரை உள்ளிடவும்.

# entertaskdesc
source: Please enter task description.
hi: कृपया कार्य का विवरण दर्ज करें.
ta: பணி விளக்கத்தை உள்ளிடவும்.

# manager
source: Leader
hi: प्रबंधक
ta: தலைவர்

source: Start Date
hi: प्रारंभ तिथि
ta: தொடக்க தேதி

source: End Date
hi: समाप्ति तिथि
ta: கடைசி தேதி

source: Due Date
ta: கடைசி தேதி

source: Tasks
ta: பணிகள்

# notasks
source: No tasks available.
ta: எந்த பணிகளும் இல்லை.

source: Add Task
ta: பணியை சேர்

source: Add
ta: சேர்க்க

source: Cancel
ta: ரத்து செய்

source: Save
ta: சேமி

source: Edit Task
ta: பணி திருத்தம்

source: From
ta: தொடக்கம்

source: To
ta: முடிவு

source: Completed
ta: முடிந்ததா

source: Members
ta: உறுப்பினர்கள்

source: Welcome,
ta: வருக,

# noprojects
source: No projects available.
ta: எந்த திட்டங்களும் இல்லை.

# selectlang
source: Select App Language:
ta: பயன்பாட்டு மொழியைத் தேர்ந்தெடுக்கவும்

source: Task Hours
ta: பணி நேரம்

# entertaskhours
source: Please enter task hours.
ta: பணி நேரத்தை உள்ளிடவும்.

source: Email
ta: மின்னஞ்சல்

source: Password
ta: கடவுச்சொல்

source: Confirm Password
ta: கடவுச்சொல் மறுபதிவிடுக

source: Login
ta: உள்நுழைக

# donthaveaccount
source: Don't have an account?
ta: கணக்கு இல்லையா?

source: Sign Up
ta: பதிவு செய்ய

# alreadyhaveaccount
source: Already have an account?
ta: கணக்கு உள்ளதா?

source: Reports
ta: ஆவணங்கள்

source: Mark As Complete
ta: முழுமையானதாகக் குறிக்க

source: Edit Project
ta: திட்டத்தைத் திருத்த

source: Delete Project
ta: திட்டத்தை நீக்க

source: Delete Task
ta: பணியை நீக்க

source: Kumaran's Projects
ta: குமரன்'

source: Status
ta: நிலை

# taskMembers
source: Select Members
ta: உறுப்பினர்கள்

# enterTaskMembers
source: Please select team members
ta: உறுப்பினர்களை உள்ளிடவும்.

# siginin
source: Sign In
ta: உள்நுழைக

# welcomewithoutcomma
source: Welcome
ta: வருக

source: KS ProjectHub
ta: கே எஸ் திட்ட மையம்

# aboutOne
source: Empower your team with our intuitive project management app, designed to streamline workflows and boost productivity.
ta: பணிப்பாய்வுகளை நெறிப்படுத்தவும் உற்பத்தித்திறனை அதிகரிக்கவும் வடிவமைக்கப்பட்ட எங்கள் உள்ளுணர்வு திட்ட மேலாண்மை பயன்பாட்டின் மூலம் உங்கள் குழுவை மேம்படுத்தலாம்.

# aboutTwo
source: Experience the convenience of managing tasks, deadlines, and team communication all in one place.
ta: பணிகள், காலக்கெடு மற்றும் குழு தொடர்பு அனைத்தையும் ஒரே இடத்தில் நிர்வகிப்பதற்கான வசதியை அனுபவியுங்கள்.

# aboutThree
source: Join the thousands of teams already achieving success with our project management app.
ta: எங்கள் திட்ட மேலாண்மை பயன்பாட்டின் மூலம் ஏற்கனவே வெற்றியை அடைந்துள்ள ஆயிரக்கணக்கான குழுக்களில் சேருங்கள்.

# teamMemberList
source: Team Members
ta: குழு உறுப்பினர்கள்

# pleaseenterstartdate
source: Please select start date.
ta: தொடக்க தேதியைத் தேர்ந்தெடுக்கவும்.

# pleaseenterenddate
source: Please select end date.
ta: இறுதி தேதியைத் தேர்ந்தெடுக்கவும்.

# priority
source: Task Priority
ta: முன்னுரிமை

source: Email is required
ta: மின்னஞ்சல் தேவை

source: Password is required
ta: கடவுச்சொல் தேவை

# invalidCredentials
source: Invaild Login Credentials
ta: தவறான உள்நுழைவு சான்றுகள்

source: Confirm password is required
ta: உறுதிப்படுத்த கடவுச்சொல் தேவை

source: Back
ta: திரும்ப

source: Active Tasks
ta: பணிகள்

source: Please select team members.
ta: குழு உறுப்பினர்களைத் தேர்ந்தெடுக்கவும்.

source: Please select priority.
ta: முன்னுரிமையைத் தேர்ந்தெடுக்கவும்.

source: Due Date For Task
ta: பணிக்கான கடைசி தேதி

# selectStartDate
source: Start Date for Project
ta: தொடக்க தேதி

# selectEndDate
source: End Date for Project
ta: கடைசி தேதி

source: Notifications
ta: அறிவிப்புகள்

# todayistheEndDate
source: Today is the Due Date for Project
ta: இன்று திட்டத்தின் இறுதி தேதி

# editButton
source: Update
ta: திருத்த

source: All
ta: அனைத்து

source: Progress
ta: முன்னேற்றம்

source: Done
ta: முடிந்தது

# areYouSureDeleteProject
source: Are you sure you want to delete the project?
ta: நீங்கள் திட்டத்தை நீக்க விரும்புகிறீர்களா??

# areYouSureCompleteProject
source: Are you sure you want to mark this project as completed?
ta: நீங்கள் இந்த திட்டத்தை முடிக்கப்பட்டதாகக் குறிக்க விரும்புகிறீர்களா??

source: Delete
ta: நீக்கு

source: Ok
ta: சரி

source: Marked as Done
ta: முடிந்தது என குறிக்கப்பட்டது

source: No tasks available. Cannot mark project as completed.
ta: பணிகள் இல்லை. திட்டத்தை முடிந்தது என குறிக்க முடியாது.

source: Was Completed
ta: முடிந்தது

source: All tasks must be completed before marking the project as completed
ta: திட்டத்தை முடிந்தது என குறிக்கும் முன் அனைத்து வேலைகளும் முடிக்கப்பட வேண்டும்

source: Failed to mark project as completed
ta: திட்டத்தை முடிந்தது என குறிக்க தோல்வி அடைந்தது

# projectDetailsWasEditedSuccessfully
source: Project Details Edited Successfully
ta: திட்ட விவரங்கள் வெற்றிகரமாக திருத்தப்பட்டது

source: Failed to update the project
ta: திட்டத்தை புதுப்பிக்க முடியவில்லை

source: Invalid date format
ta: தவறான தேதி வடிவம்

source: Was Deleted successfully
ta: வெற்றிகரமாக நீக்கப்பட்டது

source: Selected team members count was exceeded.
ta: தேர்ந்தெடுக்கப்பட்ட குழு உறுப்பினர்களின் எண்ணிக்கை மீறப்பட்டது.

source: Total Hours Exceeded.
ta: மொத்த நேரம் மீறப்பட்டது.

source: Task Edited Successfully
ta: வேலை வெற்றிகரமாக திருத்தப்பட்டது

# someSelectedTeamMembersAreAssignedToOtherProjectsPleaseCheck
source: ome selected team members are assigned to other projects. Please check.
ta: சில தேர்ந்தெடுக்கப்பட்ட குழு உறுப்பினர்(கள்) பிற திட்டங்களுக்கு ஒதுக்கப்பட்டுள்ளனர். தயவுசெய்து சரிபார்க்கவும்.

source: Task Added Successfully
ta: பணி வெற்றிகரமாக சேர்க்கப்பட்டது

# allTeamMembersMustMarkTaskAsDone
source: All team members must mark the task as done before it can be completed.
ta: அனைத்து குழு உறுப்பினர்களும் பணி முடிந்ததாக குறிக்க வேண்டும், பிறகு தான் பணியை முடிக்க முடியும்.
